iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        encoder.member("FW_Version", GRBL_VERSION);
        encoder.member("FW_Build", GRBL_VERSION_BUILD);
        encoder.member("FW_Target", "grbl-embedded");

#ifdef ENABLE_SD_CARD
        encoder.member("FW_HW", "Direct SD");
#else
        encoder.member("FW_HW", "No SD");
#endif
        encoder.member("Primary_Sd", SD_API_ENDPOINT);
        encoder.member("Secondary_Sd", "none");
#ifdef ENABLE_AUTHENTICATION
        encoder.member("Authentication", "yes");
#else
        encoder.member("Authentication", "no");
#endif
#if defined(ENABLE_WIFI)
#if defined(ENABLE_HTTP)
        encoder.begin_named_object("Webcommunication");
        encoder.member("Mode", "Sync");
        encoder.member("Websocket_Port", String(web_server.port() + 1));
        encoder.member("Telnet_Port", String(8080));
        switch (WiFi.getMode())
        {
        case WIFI_MODE_AP:
            encoder.member("Wifi_Ip", WiFi.softAPIP().toString());
            break;
        case WIFI_MODE_STA:
            encoder.member("Wifi_Ip", WiFi.localIP().toString());
            break;
        case WIFI_MODE_APSTA:
            encoder.member("Wifi_Ip", WiFi.softAPIP().toString());
            break;
        default:
            encoder.member("Wifi_Ip", "0.0.0.0");
            break;
        }
#endif
        encoder.member("Hostname", wifi_config.Hostname());
        if (WiFi.getMode() == WIFI_AP)
        {
            encoder.member("Wifi_Mode", "AP");
        }
        else
        {
            encoder.member("Wifi_Mode", "STA");
        }
        encoder.end_object();
#endif
        // to save time in decoding `?`
        encoder.member("Axis_Count", String(number_axis->get()));

        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
    }

    void Web_Server::handle_grbl_settings()
    {
        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("Settings");
        for (Setting *s = Setting::List; s; s = s->next())
        {
            if (s->getType() == GRBL && s->getGrblName())
            {
                encoder.begin_object();
                encoder.member("Name", s->getGrblName());
                encoder.member("Value", s->getStringValue());
                encoder.end_object();
            }
        }
        encoder.end_array();
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end().c_str());
    }

    // login status check
    void Web_Server::handle_login()
    {
#ifdef ENABLE_AUTHENTICATION
        String smsg;
        String sUser, sPassword;
        String auths;
        int code = 200;
        bool msg_alert_error = false;
        // disconnect can be done anytime no need to check credential
        if (_webserver->hasArg("DISCONNECT"))
        {
            String cookie = _webserver->header("Cookie");
            int pos = cookie.indexOf("ESPSESSIONID=");
            String sessionID;
            if (pos != -1)
            {
                int pos2 = cookie.indexOf(";", pos);
                sessionID = cookie.substring(pos + strlen("ESPSESSIONID="), pos2);
            }
            ClearAuthIP(_webserver->client().remoteIP(), sessionID.c_str());
            _webserver->sendHeader("Set-Cookie", "ESPSESSIONID=0");
            _webserver->sendHeader("Cache-Control", "no-cache");
            String buffer2send = "{\"status\":\"Ok\",\"authentication_lvl\":\"guest\"}";
            _webserver->send(code, "application/json", buffer2send);
            //_webserver->client().stop();
            return;
        }

        AuthenticationLevel auth_level = is_authenticated();
        if (auth_level == AuthenticationLevel::LEVEL_GUEST)
        {
            auths = "guest";
        }
        else if (auth_level == AuthenticationLevel::LEVEL_USER)
        {
            auths = "user";
        }
        else if (auth_level == AuthenticationLevel::LEVEL_ADMIN)
        {
            auths = "admin";
        }
        else
        {
            auths = "???";
        }

        // check is it is a submission or a query
        if (_webserver->hasArg("SUBMIT"))
        {
            // is there a correct list of query?
            if (_webserver->hasArg("PASSWORD") && _webserver->hasArg("USER"))
            {
                // USER
                sUser = _webserver->arg("USER");
                if (!((sUser == DEFAULT_ADMIN_LOGIN) || (sUser == DEFAULT_USER_LOGIN)))
                {
                    msg_alert_error = true;
                    smsg = "Error : Incorrect User";
                    code = 401;
                }

                if (msg_alert_error == false)
                {
                    // Password
                    sPassword = _webserver->arg("PASSWORD");
                    String sadminPassword = admin_password->get();
                    String suserPassword = user_password->get();

                    if (!(sUser == DEFAULT_ADMIN_LOGIN && sPassword == sadminPassword) ||
                        (sUser == DEFAULT_USER_LOGIN && sPassword == suserPassword))
                    {
                        msg_alert_error = true;
                        smsg = "Error: Incorrect password";
                        code = 401;
                    }
                }
            }
            else
            {
                msg_alert_error = true;
                smsg = "Error: Missing data";
                code = 500;
            }
            // change password
            if (_webserver->hasArg("PASSWORD") && _webserver->hasArg("USER") && _webserver->hasArg("NEWPASSWORD") &&
                (msg_alert_error == false))
            {
                String newpassword = _webserver->arg("NEWPASSWORD");

                char pwdbuf[MAX_LOCAL_PASSWORD_LENGTH + 1];
                newpassword.toCharArray(pwdbuf, MAX_LOCAL_PASSWORD_LENGTH + 1);

                if (COMMANDS::isLocalPasswordValid(pwdbuf))
                {
                    Error err;

                    if (sUser == DEFAULT_ADMIN_LOGIN)
                    {
                        err = admin_password->setStringValue(pwdbuf);
                    }
                    else
                    {
                        err = user_password->setStringValue(pwdbuf);
                    }
                    if (err != Error::Ok)
                    {
                        msg_alert_error = true;
                        smsg = "Error: Cannot apply changes";
                        code = 500;
                    }
                }
                else
                {
                    msg_alert_error = true;
                    smsg = "Error: Incorrect password";
                    code = 500;
                }
            }
            if ((code == 200) || (code == 500))
            {
                AuthenticationLevel current_auth_level;
                if (sUser == DEFAULT_ADMIN_LOGIN)
                {
                    current_auth_level = AuthenticationLevel::LEVEL_ADMIN;
                }
                else if (sUser == DEFAULT_USER_LOGIN)
                {
                    current_auth_level = AuthenticationLevel::LEVEL_USER;
                }
                else
                {
                    current_auth_level = AuthenticationLevel::LEVEL_GUEST;
                }
                // create Session
                if ((current_auth_level != auth_level) || (auth_level == AuthenticationLevel::LEVEL_GUEST))
                {
                    AuthenticationIP *current_auth = new AuthenticationIP;
                    current_auth->level = current_auth_level;
                    current_auth->ip = _webserver->client().remoteIP();
                    strcpy(current_auth->sessionID, create_session_ID());
                    strcpy(current_auth->userID, sUser.c_str());
                    current_auth->last_time = millis();
                    if (AddAuthIP(current_auth))
                    {
                        String tmps = "ESPSESSIONID=";
                        tmps += current_auth->sessionID;
                        _webserver->sendHeader("Set-Cookie", tmps);
                        _webserver->sendHeader("Cache-Control", "no-cache");
                        switch (current_auth->level)
                        {
                        case AuthenticationLevel::LEVEL_ADMIN:
                            auths = "admin";
                            break;
                        case AuthenticationLevel::LEVEL_USER:
                            auths = "user";
                            break;
                        default:
                            auths = "guest";
                            break;
                        }
                    }
                    else
                    {
                        delete current_auth;
                        msg_alert_error = true;
                        code = 500;
                        smsg = "Error: Too many connections";
                    }
                }
            }
            if (code == 200)
            {
                smsg = "Ok";
            }

            // build  JSON
            String buffer2send = "{\"status\":\"" + smsg + "\",\"authentication_lvl\":\"";
            buffer2send += auths;
            buffer2send += "\"}";
            _webserver->send(code, "application/json", buffer2send);
        }
        else
        {
            if (auth_level != AuthenticationLevel::LEVEL_GUEST)
            {
                String cookie = _webserver->header("Cookie");
                int pos = cookie.indexOf("ESPSESSIONID=");
                String sessionID;
                if (pos != -1)
                {
                    int pos2 = cookie.indexOf(";", pos);
                    sessionID = cookie.substring(pos + strlen("ESPSESSIONID="), pos2);
                    AuthenticationIP *current_auth_info = GetAuth(_webserver->client().remoteIP(), sessionID.c_str());
                    if (current_auth_info != NULL)
                    {
                        sUser = current_auth_info->userID;
                    }
                }
            }
            String buffer2send = "{\"status\":\"200\",\"authentication_lvl\":\"";
            buffer2send += auths;
            buffer2send += "\",\"user\":\"";
            buffer2send += sUser;
            buffer2send += "\"}";
            _webserver->send(code, "application/json", buffer2send);
        }
#else
        JSONencoder encoder;
        encoder.begin();
        encoder.member(JSONencoder::status, "Ok");
        encoder.member("authentication_lvl", "admin");
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
#endif
    }

