iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
    // abort reception of packages
    void Web_Server::cancelUpload()
    {
        if (_webserver && _webserver->client().available() > 0)
        {
            HTTPUpload &upload = _webserver->upload();
            upload.status = UPLOAD_FILE_ABORTED;
            errno = ECONNABORTED;
            _webserver->client().stop();
            delay(100);
        }
    }

    // SPIFFS files uploader handle
    void Web_Server::SPIFFSFileupload()
    {
        static String filename;
        static File fsUploadFile = (File)0;

        // get authentication status
        AuthenticationLevel auth_level = is_authenticated();
        // Guest cannot upload - only admin
        if (auth_level == AuthenticationLevel::LEVEL_GUEST)
        {
            _upload_status = UploadStatusType::FAILED;
            grbl_send(CLIENT_ALL, "[MSG:Upload rejected]\r\n");
            pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
        }
        else
        {
            HTTPUpload &upload = _webserver->upload();
            if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START))
            {
                // Upload start
                //**************
                if (upload.status == UPLOAD_FILE_START)
                {
                    _upload_status = UploadStatusType::ONGOING;
                    String upload_filename = upload.filename;
                    if (upload_filename[0] != '/')
                    {
                        filename = "/" + upload_filename;
                    }
                    else
                    {
                        filename = upload.filename;
                    }

                    // according User or Admin the root is different as user is isolate to /user when admin has full access
                    if (auth_level != AuthenticationLevel::LEVEL_ADMIN)
                    {
                        upload_filename = filename;
                        filename = "/user" + upload_filename;
                    }

                    if (SPIFFS.exists(filename))
                    {
                        SPIFFS.remove(filename);
                    }
                    if (fsUploadFile)
                    {
                        fsUploadFile.close();
                    }
                    String sizeargname = upload.filename + "S";
                    if (_webserver->hasArg(sizeargname))
                    {
                        uint32_t filesize = _webserver->arg(sizeargname).toInt();
                        uint32_t freespace = SPIFFS.totalBytes() - SPIFFS.usedBytes();
                        if (filesize > freespace)
                        {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                        }
                    }

                    if (_upload_status != UploadStatusType::FAILED)
                    {
                        // create file
                        fsUploadFile = SPIFFS.open(filename, FILE_WRITE);
                        // check If creation succeed
                        if (fsUploadFile)
                        {
                            // if yes upload is started
                            _upload_status = UploadStatusType::ONGOING;
                        }
                        else
                        {
                            // if no set cancel flag
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_FILE_CREATION, "File creation failed");
                        }
                    }
                    // Upload write
                    //**************
                }
                else if (upload.status == UPLOAD_FILE_WRITE)
                {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    // check if file is available and no error
                    if (fsUploadFile && _upload_status == UploadStatusType::ONGOING)
                    {
                        // no error so write post date
                        if (upload.currentSize != fsUploadFile.write(upload.buf, upload.currentSize))
                        {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                        }
                    }
                    else
                    {
                        // we have a problem set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                    // Upload end
                    //**************
                }
                else if (upload.status == UPLOAD_FILE_END)
                {
                    // check if file is still open
                    if (fsUploadFile)
                    {
                        // close it
                        fsUploadFile.close();
                        // check size
                        String sizeargname = upload.filename + "S";
                        fsUploadFile = SPIFFS.open(filename, FILE_READ);
                        uint32_t filesize = fsUploadFile.size();
                        fsUploadFile.close();

                        if (_webserver->hasArg(sizeargname) && _webserver->arg(sizeargname) != String(filesize))
                        {
                            _upload_status = UploadStatusType::FAILED;
                        }

                        if (_upload_status == UploadStatusType::ONGOING)
                        {
                            _upload_status = UploadStatusType::SUCCESSFUL;
                        }
                        else
                        {
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_UPLOAD, "File upload failed");
                        }
                    }
                    else
                    {
                        // we have a problem set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        pushError(ESP_ERROR_FILE_CLOSE, "File close failed");
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                    }
                    // Upload cancelled
                    //**************
                }
                else
                {
                    _upload_status = UploadStatusType::FAILED;
                    // pushError(ESP_ERROR_UPLOAD, "File upload failed");
                    return;
                }
            }
        }

